wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
/******************************************************************************
* File Name: secure_http_server.c
*
* Description: This file contains the necessary functions to start the HTTPS
* server and processes GET, POST, and PUT request from the HTTPS client.
*
* Related Document: See README.md
*******************************************************************************
* Copyright 2020-2023, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/* Header file includes */
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"

/* FreeRTOS header file */
#include <FreeRTOS.h>
#include <task.h>

/* Cypress Secure Sockets header file */
#include "cy_secure_sockets.h"
#include "cy_tls.h"

/* Wi-Fi connection manager header files */
#include "cy_wcm.h"
#include "cy_wcm_error.h"

/* Standard C header file */
#include <string.h>

/* HTTPS server task header file. */
#include "secure_http_server.h"
#include "cy_http_server.h"
#include "secure_keys.h"

/* MDNS responder header file */
#include "mdns.h"

/* TPM */
#include <wolftpm/tpm2_wrap.h>
extern WOLFTPM2_DEV mDev;

/*******************************************************************************
* Global Variables
********************************************************************************/
/* Holds the IP address obtained using Wi-Fi Connection Manager (WCM). */
static cy_wcm_ip_address_t ip_addr;

/* Secure HTTP server instance. */
static cy_http_server_t https_server;

/* Wi-Fi network interface. */
static cy_network_interface_t nw_interface;

/* Holds the IP address and port number details of the socket for the HTTPS server. */
static cy_socket_sockaddr_t https_ip_address;

/* Holds the security configuration such as server certificate,
 * server key, and rootCA.
 */
static cy_https_server_security_info_t security_config;

/* Holds the response handler for HTTPS GET and POST request from the client. */
static cy_resource_dynamic_data_t https_get_post_resource;

/* Holds the user data which adds/updates the URL data resources. */
static cy_resource_dynamic_data_t https_put_resource;

/* Queues the HTTPS PUT request to register new page resource in the server. */
static QueueHandle_t register_resource_queue_handle;

/* HTTPS new page resource name */
static char resource_name[NEW_RESOURCE_NAME_LENGTH] = {0};

/* Global variable to track number of resources registered. */
static uint32_t number_of_resources_registered = 0;

/* Holds all the URL resources along with its data. */
typedef struct
{
    char *resource_name;
    char *value;
    uint32_t length;
} https_url_database_t;

/* Initializes the URL database with first entry reserved for HTTPS root URL.
 * The default value of MAX_NUMBER_OF_HTTP_SERVER_RESOURCES is 10 as defined
 * by the HTTPS server middleware. This can be overriden by setting its value
 * in the application Makefile. Refer to README.md for details.
 */
static https_url_database_t url_resources_db[MAX_NUMBER_OF_HTTP_SERVER_RESOURCES] =
{
    /* First entry in the URL database is reserved for HTTPS Root URL. */
    { (char *)"/", NULL, 0 }
};

typedef struct {
    byte*  manifest_buf;
    byte*  firmware_buf;
    size_t manifest_bufSz;
    size_t firmware_bufSz;
} fw_info_t;

static fw_info_t mFwInfo;

/******************************************************************************
* Function Prototypes
*******************************************************************************/
static cy_rslt_t configure_https_server(void);
void print_heap_usage(char *msg);
extern const char* TPM2_IFX_GetInfo(void);


#if 0 /* TODO: Add HTTP post callback */
static int TPM2_IFX_FwData_Cb(uint8_t* data, uint32_t data_req_sz,
    uint32_t offset, void* cb_ctx)
{
    fw_info_t* fwinfo = (fw_info_t*)cb_ctx;
    if (offset > fwinfo->firmware_bufSz) {
        return BUFFER_E;
    }
    if (offset + data_req_sz > (uint32_t)fwinfo->firmware_bufSz) {
        data_req_sz = (uint32_t)fwinfo->firmware_bufSz - offset;
    }
    if (data_req_sz > 0) {
        XMEMCPY(data, &fwinfo->firmware_buf[offset], data_req_sz);
    }
    return data_req_sz;
}
#endif

#define HTTPS_STARTUP_HEADER \
"<!DOCTYPE html>" \
"<html>" \
"<head>" \
"<title>Infineon TPM Firmware Update Demo</title>" \
"</head>" \
"<body>" \
"<h1>Infineon TPM Firmware Update Demo</h1>" \
"<p><span style=\"font-size: 12pt;\"><strong>Infineon</strong> is the first TPM vendor to <strong>open source their firmware update procedure and process</strong> in their latest <strong>Infineon SLB9672 (SPI) and SLB9673 (I2C)</strong> versions of the TPM 2.0 module.</span></p>" \
"<p><span style=\"font-size: 12pt;\"><strong>wolfTPM</strong> is the only library to off integrated support for updating TPM firmware.</span></p>" \
"<p><span style=\"text-decoration: underline;\"><span style=\"font-size: 12pt;\">Demo Platform:</span></span></p>" \
"<ul>" \
"    <li><span style=\"font-size: 12pt;\">Infineon PSoC 62S2 evaluation kit (Wifi)</span></li>" \
"    <li><span style=\"font-size: 12pt;\">Infineon SLB9373 (I2C) TPM 2.0 mikroBUS module</span></li>" \
"    <li><span style=\"font-size: 12pt;\">Modus Toolbox Wi-Fi-HTTPS-Server demo</span>" \
"    <ul>" \
"        <li><span style=\"font-size: 12pt;\">wolfSSL TLS v1.3 server</span></li>" \
"        <li><span style=\"font-size: 12pt;\">wolfTPM</span></li>" \
"    </ul>" \
"    </li>" \
"</ul>" \
"<h2>TPM Module Interface</h2>" \
"<form method=\"get\">" \
"<fieldset>" \
"    <legend>Firmware Status</legend>" \
"    <input type=\"submit\" value=\"Refresh TPM\"/>" \
"    <textarea id=\"tpm_status\" name=\"tpm_status\" rows=\"4\" cols=\"60\">"

