wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
#define HTTPS_STARTUP_FOOTER \
"    </textarea>" \
"</fieldset>" \
"</form>" \
"<form method=\"post\">" \
"<fieldset>" \
"    <legend>Firmware Update</legend>" \
"    <p>" \
"        <label for=\"manifest\">Manifest File:</label>" \
"        <input type=\"file\" name=\"manifest\" value=\"Manifest File\"/></br></br>" \
"    </p>" \
"    <p>" \
"        <label for=\"data\">Firmware File:</label>" \
"        <input type=\"file\" name=\"data\" value=\"Firmware File\"/>" \
"    </p>" \
"</fieldset>" \
"</form>" \
"</body>" \
"</html>"



/*******************************************************************************
 * Function Name: dynamic_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTPS GET, POST, and PUT requests from the client.
 *  HTTPS GET sends the current CYBSP_USER_LED status as a response to the client.
 *  HTTPS POST toggles the CYBSP_USER_LED and then sends its current state as a
 *  response to the client.
 *  HTTPS PUT sends an error message as a response to the client if the resource
 *  registration is unsuccessful.
 *
 * Parameters:
 *  url_path - Pointer to the HTTPS URL path.
 *  url_parameters - Pointer to the HTTPS URL query string.
 *  stream - Pointer to the HTTPS response stream.
 *  arg - Pointer to the argument passed during HTTPS resource registration.
 *  https_message_body - Pointer to the HTTPS data from the client.
 *
 * Return:
 *  int32_t - Returns HTTPS_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTPS_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t dynamic_resource_handler(const char* url_path,
                                 const char* url_parameters,
                                 cy_http_response_stream_t* stream,
                                 void* arg,
                                 cy_http_message_body_t* https_message_body)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTPS_REQUEST_HANDLE_SUCCESS;
    char https_response[MAX_HTTP_RESPONSE_LENGTH] = {0};
    char *register_new_resource = NULL;
    const char* msg;

    switch (https_message_body->request_type)
    {
        case CY_HTTP_REQUEST_GET:
            APP_INFO(("Received HTTPS GET request.\n"));

            /* Send the HTTPS response. */
            msg = HTTPS_STARTUP_HEADER;
            result = cy_http_server_response_stream_write_payload(stream,
                msg, strlen(msg));
            if (CY_RSLT_SUCCESS == result) {
                msg = TPM2_IFX_GetInfo();
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
            }
            if (CY_RSLT_SUCCESS == result) {
                msg = HTTPS_STARTUP_FOOTER;
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
            }
            if (CY_RSLT_SUCCESS != result) {
                ERR_INFO(("Failed to send the HTTPS GET response.\n"));
            }
            break;

        case CY_HTTP_REQUEST_POST:
            APP_INFO(("Received HTTPS POST request.\n"));

            /* TODO: Upload the files using the */
            #if 0
            rc = wolfTPM2_FirmwareUpgrade(&mDev,
                fwinfo.manifest_buf, (uint32_t)fwinfo.manifest_bufSz,
                TPM2_IFX_FwData_Cb, &mFwInfo);
            #endif
            (void)mFwInfo;

            /* Toggle the user LED. */
            cyhal_gpio_toggle(CYBSP_USER_LED);

            /* Send the HTTPS response. */
            result = cy_http_server_response_stream_write_payload(stream, https_response, sizeof(https_response));

            if (CY_RSLT_SUCCESS != result)
            {
                ERR_INFO(("Failed to send the HTTPS POST response.\n"));
            }
            break;

        case CY_HTTP_REQUEST_PUT:
            if (https_message_body->data_length > sizeof(resource_name))
            {
                /* Report the error response to the client. */
                ERR_INFO(("Resource name length exceeded the limit. Maximum: %d, Received: %d",
                    sizeof(resource_name), (https_message_body->data_length)));
                sprintf(https_response, HTTPS_RESOURCE_PUT_ERROR, sizeof(resource_name));

                /* Send the HTTPS error response. */
                result = cy_http_server_response_stream_write_payload(stream, https_response, strlen(https_response));
                if (CY_RSLT_SUCCESS != result)
                {
                    ERR_INFO(("Failed to send the HTTPS PUT error response.\n"));
                }
            }
            else
            {
                register_new_resource = (char *)&resource_name[0];
                memcpy(register_new_resource, (char *)https_message_body->data, https_message_body->data_length);

                /* Received HTTPS PUT request. Put the message into queue
                 * to register a new resource with the HTTPS server.
                 */
                if (pdTRUE != xQueueSend(register_resource_queue_handle, (void *)&register_new_resource, 0))
                {
                    ERR_INFO(("Failed to send queue message.\n"));
                }
            }
            break;

        default:
            ERR_INFO(("Received invalid HTTP request method. Supported HTTP methods are GET, POST, and PUT.\n"));
            break;
    }

    if (CY_RSLT_SUCCESS != result)
    {
        status = HTTPS_REQUEST_HANDLE_ERROR;
    }

    print_heap_usage("At the end of GET/POST/PUT request handler");

    return status;
}

/*******************************************************************************
 * Function Name: https_put_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTPS GET request for the newly created resource by the client
 *  through HTTPS PUT request. It returns the value registered with the requested
 *  resource.
 *
 * Parameters:
 *  url_path - Pointer to the HTTPS URL path.
 *  url_parameters - Pointer to the HTTPS URL query string.
 *  stream - Pointer to the HTTPS response stream.
 *  arg - Pointer to the argument passed during HTTPS resource registration.
 *  https_message_body - Pointer to the HTTPS data from the client.
 *
 * Return:
 *  int32_t - Returns HTTPS_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTPS_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t https_put_resource_handler(const char *url_path,
                                   const char *url_parameters,
                                   cy_http_response_stream_t *stream,
                                   void *arg,
                                   cy_http_message_body_t *https_message_body)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTPS_REQUEST_HANDLE_SUCCESS;
    uint32_t index = 0;

    if (CY_HTTP_REQUEST_GET == https_message_body->request_type)
    {
        APP_INFO(("Received HTTPS GET request.\n"));

