wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
        while (index < MAX_NUMBER_OF_HTTP_SERVER_RESOURCES)
        {
            if (strcmp(url_resources_db[index].resource_name, (char *)arg) == 0)
            {
                result = cy_http_server_response_stream_write_payload(stream,
                                               url_resources_db[index].value,
                                             url_resources_db[index].length);
                break;
            }

            /* Get next entry. */
            index++;
        }
    }

    if (CY_RSLT_SUCCESS != result)
    {
        ERR_INFO(("Failed to send the response message.\n"));
        status = HTTPS_REQUEST_HANDLE_ERROR;
    }

    return status;
}

/*******************************************************************************
 * Function Name: register_https_resource
 *******************************************************************************
 * Summary:
 *  Registers/Updates the new resource with the HTTPS server when HTTPS PUT
 *  request is received from the client.
 *
 * Parameters:
 *  register_resource_name: Pointer to the resource name to be registered
 *   with the HTTPS server.
 *
 * Return:
 *  None
 *
 *******************************************************************************/
void register_https_resource(char *register_resource_name)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    char *url_resource_data = NULL;
    uint32_t index = 0;

    APP_INFO(("New resource to create: %s\n", register_resource_name));

    /* Configure dynamic resource handler. */
    https_put_resource.resource_handler = https_put_resource_handler;
    https_put_resource.arg = NULL;

    /* Split the URL resource name and data from the HTTPS PUT request. */
    strtok_r(register_resource_name, "=", &url_resource_data);
    APP_INFO(("New URL: %s, Response text: %s\n", register_resource_name, url_resource_data));

    /* Register the resource if it does not exist in the URL database or
     * update the resource data if the requested resource already
     * exists in the URL database.
     */
    while (index < MAX_NUMBER_OF_HTTP_SERVER_RESOURCES)
    {
        if ((NULL != url_resources_db[index].resource_name) &&
             strcmp(url_resources_db[index].resource_name, register_resource_name) == 0)
        {
            APP_INFO(("Updating the existing resource: %s\n\n", register_resource_name));
            url_resources_db[index].length = strlen(url_resource_data);
            url_resources_db[index].value = (char *)realloc(url_resources_db[index].value, (url_resources_db[index].length + 1));
            memset(url_resources_db[index].value, 0, (url_resources_db[index].length + 1));
            memcpy(url_resources_db[index].value, url_resource_data, url_resources_db[index].length);
            https_put_resource.arg = url_resources_db[index].resource_name;
            break;
        }
        else if (NULL == url_resources_db[index].resource_name)
        {
            APP_INFO(("Registering the new resource: %s\n\n", register_resource_name));
            url_resources_db[index].value = (char *)calloc(strlen(url_resource_data), sizeof(char));
            url_resources_db[index].resource_name = (char *)calloc(strlen(register_resource_name), sizeof(char));

            if ((NULL == url_resources_db[index].resource_name) ||
                (NULL == url_resources_db[index].value))
            {
                 ERR_INFO(("Failed to allocate memory for URL resources.\n"));
                 CY_ASSERT(0);
            }

            /* Add the resource name, data, and data length into URL database. */
            url_resources_db[index].length = strlen(url_resource_data);
            memcpy(url_resources_db[index].resource_name, register_resource_name,
                                                 strlen(register_resource_name));
            memcpy(url_resources_db[index].value, url_resource_data,
                                                 url_resources_db[index].length);
            https_put_resource.arg = url_resources_db[index].resource_name;

            /* Register the new/updated resource with HTTPS server. */
            result = cy_http_server_register_resource(https_server,
                                                      (uint8_t*)url_resources_db[index].resource_name,
                                                      (uint8_t*)"text/html",
                                                      CY_DYNAMIC_URL_CONTENT,
                                                      &https_put_resource);
            PRINT_AND_ASSERT(result, "Failed to register a new resource.\n");

            /* Update the resource count. */
            number_of_resources_registered++;
            break;
        }
        else
        {
            /* Get next resource. */
            index++;
        }
    }

    if (index >= MAX_NUMBER_OF_HTTP_SERVER_RESOURCES)
    {
        ERR_INFO(("Requested resource not registered/updated. Reached Maximum "
                  "allowed number of resource registration: %d\n", MAX_NUMBER_OF_HTTP_SERVER_RESOURCES));
    }

    /* Clear the request buffer. */
    memset(resource_name, 0, sizeof(resource_name));
}

/*******************************************************************************
 * Function Name: configure_https_server
 *******************************************************************************
 * Summary:
 *  Configures the security parameters such as server certificate, private key,
 *  and the root CA certificate to start the HTTP server in secure mode. By default,
 *  it registers a dynamic URL handler to handle the HTTPS GET, POST, and PUT
 *  requests.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Returns CY_RSLT_SUCCESS if the secure HTTP server is configured
 *  successfully, otherwise, it returns CY_RSLT_TYPE_ERROR.
 *
 *******************************************************************************/
static cy_rslt_t configure_https_server(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /*
     * Setup the necessary security configuration required for establishing
     * secure HTTP connection with the secure HTTP client. This example uses
     * a self-signed certificate and is not trusted by the browser. Browsers
     * trust only the certificates signed by a CA (certificate authority).
     * To make the browser trust the connection with this HTTP server, user
     * needs to load the server certificate into the browser.
     */
    security_config.certificate                = (uint8_t *)keySERVER_CERTIFICATE_PEM;
    security_config.certificate_length         = strlen(keySERVER_CERTIFICATE_PEM);
    security_config.private_key                = (uint8_t *)keySERVER_PRIVATE_KEY_PEM;
    security_config.key_length                 = strlen(keySERVER_PRIVATE_KEY_PEM);
    security_config.root_ca_certificate        = (uint8_t *)keyCLIENT_ROOTCA_PEM;
    security_config.root_ca_certificate_length = strlen(keyCLIENT_ROOTCA_PEM);

